In [1]:
import pandas as pd 
import numpy as np

### EKSIK VERI

In [2]:
sozlukVerisi = {"Istanbul ": [30, 29,np.nan],
                "Ankara": [20,np.nan,25],
                "Izmir": [40,39,38],}
# DataFrame oluşturma
havaDurumudf = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumudf

   Istanbul   Ankara  Izmir
0       30.0    20.0     40
1       29.0     NaN     39
2        NaN    25.0     38

In [4]:
# Eksik veri ile calismak nan verileri silmek
havaDurumudf.dropna()  # satır bazında eksik verileri siler

   Istanbul   Ankara  Izmir
0       30.0    20.0     40

In [5]:
havaDurumudf.dropna(axis=1)  # sütun bazında eksik verileri siler

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri = {"Istanbul ": [30, 29,np.nan],
                "Ankara": [20,np.nan,25],
                "Izmir": [40,39,38],
                "Bursa": [35, np.nan, np.nan],}
# DataFrame oluşturma
yenihavaDurumudf = pd.DataFrame(yeniVeri)

In [7]:
yenihavaDurumudf

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     NaN     39    NaN
2        NaN    25.0     38    NaN

In [8]:
yenihavaDurumudf.fillna(0)  # eksik verileri 0 ile doldurur

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     0.0     39    0.0
2        0.0    25.0     38    0.0

In [9]:
yenihavaDurumudf.dropna(axis=1, thresh=2)  # en az 2 nan değer içeren sütunları siler

   Istanbul   Ankara  Izmir
0       30.0    20.0     40
1       29.0     NaN     39
2        NaN    25.0     38

In [16]:
yenihavaDurumudf.dropna(axis=1, thresh=1)

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0     NaN     39    NaN
2        NaN    25.0     38    NaN

In [ ]:
yenihavaDurumudf.fillna(20) # eksik verileri 20 ile doldurur

   Istanbul   Ankara  Izmir  Bursa
0       30.0    20.0     40   35.0
1       29.0    20.0     39   20.0
2       20.0    25.0     38   20.0

### Groupby

In [20]:
maasSozluk = {"Departman":["Yazilim","Yazilim","Finans","Finans","Hukuk","Hukuk"],
              "Calisan Ismi":["Ali","Ayse","Fatma","Mehmet","Hasan","Zeynep"],
              "Maas":[10000,12000,9000,15000,11000,13000],}

In [21]:
maasdf = pd.DataFrame(maasSozluk)
maasdf

  Departman Calisan Ismi   Maas
0   Yazilim          Ali  10000
1   Yazilim         Ayse  12000
2    Finans        Fatma   9000
3    Finans       Mehmet  15000
4     Hukuk        Hasan  11000
5     Hukuk       Zeynep  13000

In [23]:
grupObjesi = maasdf.groupby("Departman")

In [24]:
grupObjesi.count()  # her departmandaki çalışan sayısını sayar

           Calisan Ismi  Maas
Departman
Finans                2     2
Hukuk                 2     2
Yazilim               2     2

In [33]:
#maasdf.select_dtypes(include="number").mean()# her departmandaki maaşların ortalamasını alır
maasdf.groupby("Departman").mean(numeric_only=True)

              Maas
Departman
Finans     12000.0
Hukuk      12000.0
Yazilim    11000.0

In [34]:
grupObjesi.min()

          Calisan Ismi   Maas
Departman
Finans           Fatma   9000
Hukuk            Hasan  11000
Yazilim            Ali  10000

In [35]:
grupObjesi.max()

          Calisan Ismi   Maas
Departman
Finans          Mehmet  15000
Hukuk           Zeynep  13000
Yazilim           Ayse  12000

In [36]:
grupObjesi.describe()

           Maas                                                            \
          count     mean          std      min      25%      50%      75%
Departman
Finans      2.0  12000.0  4242.640687   9000.0  10500.0  12000.0  13500.0
Hukuk       2.0  12000.0  1414.213562  11000.0  11500.0  12000.0  12500.0
Yazilim     2.0  11000.0  1414.213562  10000.0  10500.0  11000.0  11500.0


               max
Departman
Finans     15000.0
Hukuk      13000.0
Yazilim    12000.0